Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F16A.tmx
Source language: en_us
Languages: zh_cn

source: Something for my friend
zh_cn: 跟我朋友的交谈

source: Time is running out for my friend.
zh_cn: 时光任苒，朋友已经老大不小了。

source: While we are sitting at lunch she casually mentions she and her husband are thinking of starting a family.
zh_cn: 我们坐在一起吃饭的时候，她漫不经心地提到她和她的丈夫正考虑要小孩。

source: "We're taking a survey,"she says, half-joking.
zh_cn: “我们正在做一项调查，”她半开玩笑地说。

source: "Do you think I should have a baby?"
zh_cn: “你觉得我应该要个小孩吗？”

source: "It will change your life," I say, carefully keeping my tone neutral.
zh_cn: “他将改变你的生活。”我小心翼翼地说道，尽量使语气保持客观。

source: "I know,"she says, "no more sleeping in on weekends, no more spontaneous holidays..."
zh_cn: “这我知道。”她答道，“周末睡不成懒觉，再也不能随心所欲休假了......”

source: But that's not what I mean at all.
zh_cn: 但我说的绝非这些。

source: I look at my friend, trying to decide what to tell her.
zh_cn: 我注视着朋友，试图整理一下自己的思绪。

source: I want her to know what she will never learn in childbirth classes.
zh_cn: 我想让她知道她永远不可能在分娩课上学到的东西。

source: I want to tell her that the physical wounds of child bearing will heal, but becoming a mother will leave her with an emotional wound so raw that she will be vulnerable forever.
zh_cn: 我想让她知道：分娩的有形伤疤可以愈合，但是做母亲的情感伤痕却永远如新，她会因此变得十分脆弱。

source: I consider warning her that she will never again read a newspaper without thinking: "What if that had been MY child?"
zh_cn: 我想告诫她：做了母亲后，每当她看报纸时就会情不自禁地联想：“如果那件事情发生在我的孩子身上将会怎样啊！”

source: That every plane crash, every house fire will haunt her.
zh_cn: 每一次飞机失事、每一场住宅火灾都会让她提心吊胆。

source: That when she sees pictures of starving children, she will wonder if anything could be worse than watching your child die.
zh_cn: 看到那些忍饥挨饿的孩子们的照片时，她会思索：世界上还有什么比眼睁睁地看着自己的孩子饿死更惨的事情呢？

source: I look at her carefully manicured nails and stylish suit and think that no matter how sophisticated she is, becoming a mother will reduce her to the primitive level of a bear protecting her cub.
zh_cn: 我打量着她精修细剪的指甲和时尚前卫的衣服，心里想到：不管她打扮多么考究，做了母亲后，她会变得像护崽的母熊那样原始而不修边幅。

source: I feel I should warn her that no matter how many years she has invested in her career, she will be professionally derailed by motherhood.
zh_cn: 我觉得自己应该提醒她，不管她在工作上投入了多少年，一旦做了母亲，工作就会脱离常规。

source: She might arrange for child care, but one day she will be going into an important business meeting, and she will think her baby's sweet smell.
zh_cn: 她自然可以安排他人照顾孩子，但说不定哪天她要去参加一个非常重要的商务会议，却忍不住想起宝宝身上散发的甜甜乳香。

source: She will have to use every ounce of discipline to keep from running home, just to make sure her child is all right.
zh_cn: 她不得不拼命克制自己，才不致于为了看看孩子是否安然无羔而中途回家。

source: I want my friend to know that every decision will no longer be routine.
zh_cn: 我想告诉朋友，有了孩子后，她将再也不能按照惯例做出决定。

source: That a five-year-old boy's desire to go to the men's room rather than the women's at a restaurant will become a major dilemma. The issues of independence and gender identity will be weighed against the prospect that a child molester may be lurking in the lavatory. However decisive she may be at the office, she will second-guess herself constantly as a mother.
zh_cn: 在餐馆，5岁的儿子想进男厕而不愿进女厕将成为摆在她眼前的一大难题：她将在两个选择之间权衡一番：尊重孩子的独立和性别意识，还是让他进男厕所冒险被潜在的儿童性骚扰者侵害？任凭她在办公室多么果断，作为母亲，她仍经常事后后悔自己当时的决定。

source: Looking at my attractive friend, I want to assure her that eventually she will shed the added weight of pregnancy, but she will never feel the same about herself.
zh_cn: 注视着我的这位漂亮的朋友，我想让她明确地知道，她最终会恢复到怀孕前的体重，但是她对自己的感觉已然不同。

source: That her own life, now so important, will be of less value to her once she has a child.
zh_cn: 她现在视为如此重要的生命将随着孩子的诞生而变得不那么宝贵。

source: She would give it up in a moment to save her offspring, but will also begin to hope for more years - not to accomplish her own dreams - but to watch her children accomplish theirs.
zh_cn: 为了救自己的孩子，她时刻愿意献出自己的生命。但她也开始希望多活一些年头，不是为了实现自己的梦想，而是为了看着孩子们美梦成真。

source: I want to describe to my friend the exhilaration of seeing your child learn to hit a ball.
zh_cn: 我想向朋友形容自己看到孩子学会击球时的喜悦之情。

source: I want to capture for her the belly laugh of a baby who is touching the soft fur of a dog for the first time.
zh_cn: 我想让她留意宝宝第一次触摸狗的绒毛时的捧腹大笑。

source: I want her to taste the joy that is so real it hurts.
zh_cn: 我想让她品尝快乐，尽管这快乐真实得令人心痛。

source: My friend's look makes me realize that tears have formed in my eyes.
zh_cn: 朋友的表情让我意识到自己已经是热泪盈眶。

source: "You'll never regret it," I say finally.
zh_cn: “你永远不会后悔，”我最后说。

source: Then, squeezing my friend's hand, I offer a prayer for her and me and all of the mere mortal women who stumble their way into this holiest of callings.
zh_cn: 然后紧紧地握住朋友的手，为她、为自己、也为每一位艰难跋涉、准备响应母亲职业神圣的召唤的平凡女性献上自己的祈祷。
